app/controllers/usertasks_controller.rb

  def create
  	@task = Task.find(params[:task_id])
  	@usertask = Usertask.new(task: @task, user: current_user)
  	if @usertask.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
INSERT INTO "usertasks" ("user_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["task_id", 53], ["created_at", "2019-01-27 08:17:39.555172"], ["updated_at", "2019-01-27 08:17:39.555172"]]